# Challenge Questions - TfL Dataset

# Instructions:
• Please ensure you don't overwrite any existing cells. Add new cells below by pressing ALT+ENTER

• Attempt all of the questions

• You are encouraged to look online for help should you need it

# Dataset overview:
There are three datasets stored in the same directory as this Notebook, they are all related to each other:

• **tfl-daily-cycle-hires.csv**: This dataset contains bike hire data from Transport for London during the period 
30th July 2010 to 30th September 2021. 'Day' is the day in '%d/%m/%Y' format. 'Number of Bicycle Hires' is the total number of bikes hired that day.

#

## Import pandas, numpy and datetime

In [1]:
#Type your code here
import pandas as pd
import numpy as np
import datetime as dt

## Load the files:
• "tfl-daily-cycle-hires.csv" should be assigned to the variable **tfl**

In [2]:
tfl=pd.read_csv('tfl-daily-cycle-hires.csv')

## Check the head of the DataFrame

In [4]:
tfl.head()

          Day  Number of Bicycle Hires  Unnamed: 2
0  30/07/2010                   6897.0         NaN
1  31/07/2010                   5564.0         NaN
2  01/08/2010                   4303.0         NaN
3  02/08/2010                   6642.0         NaN
4  03/08/2010                   7966.0         NaN

## Check the data types of the DataFrame columns

In [6]:
tfl.dtypes

Day                         object
Number of Bicycle Hires    float64
Unnamed: 2                 float64
dtype: object

## Change the data types and remove unnecessary columns 

• 'Day' should be a datetime64 data type

• 'Number of Bicycle Hires' should be float64

• Any other columns should be deleted

In [7]:
tfl['Day'] = pd.to_datetime(tfl['Day'],format='%d/%m/%Y')

## What is the average number of bicycle hires per day across the entire dataset?

In [8]:
tfl['Number of Bicycle Hires'].mean()

26261.932124479295

## Create a new column called 'Year' which contains the 4 digit year

In [9]:
tfl['Year']=tfl['Day'].dt.strftime('%Y')

## What is the average number of bicycle hires per Year across the entire dataset

In [11]:
tfl['Year'].mean()

inf

## What is the total number of bicycle hires per Year across the entire dataset

In [12]:
tfl.groupby(by='Year').sum()

      Number of Bicycle Hires  Unnamed: 2
Year
2010                2180813.0         0.0
2011                7142449.0         0.0
2012                9519283.0         0.0
2013                8045459.0         0.0
2014               10023897.0         0.0
2015                9871839.0         0.0
2016               10303637.0         0.0
2017               10446044.0         0.0
2018               10567540.0         0.0
2019               10424955.0         0.0
2020               10434167.0         0.0
2021                8214862.0         0.0

## Create a new column called 'Category' on the tfl DataFrame that classifies the number of bike hires per day as:
* 'Low' if the 'Number of Bicycle Hires' is below 10,000
* 'Medium' if the 'Number of Bicycle Hires' is below 40,000 but greater than or equal to 10,000
* 'High' if the 'Number of Bicycle Hires' is greater than or equal to 40,000

## For each year in the tfl DataFrame how many days are classed as 'Low', 'Medium' or 'High'?